org/study/双拼学习.org
#+TITLE: 双拼学习

* 简介
双拼其实就是打字时使用声母韵母的方案进行打字，一个字使用两个键，第一个键表示声，第二个键表示韵母。如：常字，声母是ch,对应键盘为i键，韵母是ang，对应键盘是h，所以打常字使用ih即可打出。
双拼的方案有很多，如小鹤双拼，自然码，微软双拼等等，各人选择的是小鹤双拼:https://www.flypy.com/
* 双拼方案
小鹤音形：其实就是打字加选字的过程，打字用双拼，找字用双形。如音字，打字是y + in,对应到键盘的按键就是yb,而找字则是音拆分为立+日，对应到键盘上是l+o,所以音采用小鹤音形打出来的全码就是yblo.
那么你要问，这和五笔有什么区别？光看这个例子确实没有区别，其主要的区别就是打词组非常方便，比如我打"区别"两字，只需要敲击qubp，这两字就直接到屏幕上了。小鹤音形配置了很多常用的词组，所以其默认组合已经满足了日常打字需求，且速度在多练后可以非常的快。
* 输入法
ios:使用irime输入法
macos:使用rime输入法并挂接小鹤音形，可在小鹤双拼官网查到其教程。
