study/双拼学习.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-04 Tue 00:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>双拼学习</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="qxg" />
<link rel="shortcut icon" type="image/x-icon" href="/static/img/favicon.ico">
<link rel="stylesheet" type="text/css" href="/static/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/static/css/readtheorg.css"/><link rel="stylesheet" type="text/css" href="/static/css/orgstyle.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/index.html"> UP </a>
 |
 <a accesskey="H" href="/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">双拼学习</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org640c03b">简介</a></li>
<li><a href="#org5342da0">双拼方案</a></li>
<li><a href="#orgf9453a7">输入法</a></li>
<li><a href="#org89a83e4">练习地址</a></li>
<li><a href="#org0d3d46b">桌面背景</a></li>
<li><a href="#orgc8b6d6a">小鹤音形各拼音默认字词</a>
<ul>
<li><a href="#org9b7f96c">单</a></li>
<li><a href="#org7bb42a9">q</a></li>
<li><a href="#org942fdb3">w</a></li>
<li><a href="#org70bfa05">e</a></li>
<li><a href="#org93b72a1">r</a></li>
<li><a href="#org335b32f">t</a></li>
<li><a href="#org0588cb9">y</a></li>
<li><a href="#org9290749">u</a></li>
<li><a href="#orgad04f67">i</a></li>
<li><a href="#orgc7d6efa">o</a></li>
<li><a href="#org6d07664">p</a></li>
<li><a href="#org4c1dee9">a</a></li>
<li><a href="#orgf2c330c">s</a></li>
<li><a href="#org4102310">d</a></li>
<li><a href="#org5dc318a">f</a></li>
<li><a href="#org50b8a0a">g</a></li>
<li><a href="#org20c46d9">h</a></li>
<li><a href="#orgee4f98d">j</a></li>
<li><a href="#orgf4599f7">k</a></li>
<li><a href="#orgc7be6b8">l</a></li>
<li><a href="#org4b8c955">z</a></li>
<li><a href="#orgfd6ee52">x</a></li>
<li><a href="#orgf8c3e98">c</a></li>
<li><a href="#org7673433">v</a></li>
<li><a href="#org0a749e0">b</a></li>
<li><a href="#org0c8c590">n</a></li>
<li><a href="#org6dc72eb">m</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org640c03b" class="outline-2">
<h2 id="org640c03b">简介</h2>
<div class="outline-text-2" id="text-org640c03b">
<p>
双拼其实就是打字时使用声母韵母的方案进行打字，一个字使用两个键，第一个键表示声，第二个键表示韵母。如：常字，声母是ch,对应键盘为i键，韵母是ang，对应键盘是h，所以打常字使用ih即可打出。
双拼的方案有很多，如小鹤双拼，自然码，微软双拼等等，各人选择的是小鹤双拼:<a href="https://www.flypy.com/">https://www.flypy.com/</a>
</p>
</div>
</div>
<div id="outline-container-org5342da0" class="outline-2">
<h2 id="org5342da0">双拼方案</h2>
<div class="outline-text-2" id="text-org5342da0">
<p>
小鹤音形：其实就是打字加选字的过程，打字用双拼，找字用双形。如音字，打字是y + in,对应到键盘的按键就是yb,而找字则是音拆分为立+日，对应到键盘上是l+o,所以音采用小鹤音形打出来的全码就是yblo.
那么你要问，这和五笔有什么区别？光看这个例子确实没有区别，其主要的区别就是打词组非常方便，比如我打"区别"两字，只需要敲击qubp，这两字就直接到屏幕上了。小鹤音形配置了很多常用的词组，所以其默认组合已经满足了日常打字需求，且速度在多练后可以非常的快。
</p>
</div>
</div>
<div id="outline-container-orgf9453a7" class="outline-2">
<h2 id="orgf9453a7">输入法</h2>
<div class="outline-text-2" id="text-orgf9453a7">
<p>
ios:使用irime输入法
macos:使用rime输入法并挂接小鹤音形，可在小鹤双拼官网查到其教程。
</p>
</div>
</div>
